feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Prog/Libraries/Infra/Sfr/TC27D/_Reg/IfxSent_bf.h
/**
 * \file IfxSent_bf.h
 * \brief
 * \copyright Copyright (c) 2016 Infineon Technologies AG. All rights reserved.
 *
 * Version: TC27XD_UM_V2.2.R1
 * Specification: tc27xD_um_v2.2_SFR.xml (Revision: UM_V2.2)
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 * Use of this file is subject to the terms of use agreed between (i) you or
 * the company in which ordinary course of business you are acting and (ii)
 * Infineon Technologies AG or its licensees. If and as long as no such terms
 * of use are agreed, use of this file is subject to following:
 *
 * Boost Software License - Version 1.0 - August 17th, 2003
 *
 * Permission is hereby granted, free of charge, to any person or organization
 * obtaining a copy of the software and accompanying documentation covered by
 * this license (the "Software") to use, reproduce, display, distribute,
 * execute, and transmit the Software, and to prepare derivative works of the
 * Software, and to permit third-parties to whom the Software is furnished to
 * do so, all subject to the following:
 *
 * The copyright notices in the Software and this entire statement, including
 * the above license grant, this restriction and the following disclaimer, must
 * be included in all copies of the Software, in whole or in part, and all
 * derivative works of the Software, unless such copies or derivative works are
 * solely in the form of machine-executable object code generated by a source
 * language processor.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. IN NO EVENT
 * SHALL THE COPYRIGHT HOLDERS OR ANYONE DISTRIBUTING THE SOFTWARE BE LIABLE
 * FOR ANY DAMAGES OR OTHER LIABILITY, WHETHER IN CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 *
 * \defgroup IfxLld_Sent_BitfieldsMask Bitfields mask and offset
 * \ingroup IfxLld_Sent
 * 
 */
#ifndef IFXSENT_BF_H
#define IFXSENT_BF_H 1
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Sent_BitfieldsMask
 * \{  */

/** \brief  Length for Ifx_SENT_ACCEN0_Bits.EN0 */
#define IFX_SENT_ACCEN0_EN0_LEN (1u)

/** \brief  Mask for Ifx_SENT_ACCEN0_Bits.EN0 */
#define IFX_SENT_ACCEN0_EN0_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_ACCEN0_Bits.EN0 */
#define IFX_SENT_ACCEN0_EN0_OFF (0u)

/** \brief  Length for Ifx_SENT_ACCEN0_Bits.EN10 */
#define IFX_SENT_ACCEN0_EN10_LEN (1u)

/** \brief  Mask for Ifx_SENT_ACCEN0_Bits.EN10 */
#define IFX_SENT_ACCEN0_EN10_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_ACCEN0_Bits.EN10 */
#define IFX_SENT_ACCEN0_EN10_OFF (10u)

/** \brief  Length for Ifx_SENT_ACCEN0_Bits.EN11 */
#define IFX_SENT_ACCEN0_EN11_LEN (1u)

/** \brief  Mask for Ifx_SENT_ACCEN0_Bits.EN11 */
#define IFX_SENT_ACCEN0_EN11_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_ACCEN0_Bits.EN11 */
#define IFX_SENT_ACCEN0_EN11_OFF (11u)

/** \brief  Length for Ifx_SENT_ACCEN0_Bits.EN12 */
#define IFX_SENT_ACCEN0_EN12_LEN (1u)

/** \brief  Mask for Ifx_SENT_ACCEN0_Bits.EN12 */
#define IFX_SENT_ACCEN0_EN12_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_ACCEN0_Bits.EN12 */
#define IFX_SENT_ACCEN0_EN12_OFF (12u)

/** \brief  Length for Ifx_SENT_ACCEN0_Bits.EN13 */
#define IFX_SENT_ACCEN0_EN13_LEN (1u)

/** \brief  Mask for Ifx_SENT_ACCEN0_Bits.EN13 */
#define IFX_SENT_ACCEN0_EN13_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_ACCEN0_Bits.EN13 */
#define IFX_SENT_ACCEN0_EN13_OFF (13u)

/** \brief  Length for Ifx_SENT_ACCEN0_Bits.EN14 */
#define IFX_SENT_ACCEN0_EN14_LEN (1u)

/** \brief  Mask for Ifx_SENT_ACCEN0_Bits.EN14 */
#define IFX_SENT_ACCEN0_EN14_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_ACCEN0_Bits.EN14 */
#define IFX_SENT_ACCEN0_EN14_OFF (14u)

/** \brief  Length for Ifx_SENT_ACCEN0_Bits.EN15 */
#define IFX_SENT_ACCEN0_EN15_LEN (1u)

/** \brief  Mask for Ifx_SENT_ACCEN0_Bits.EN15 */
#define IFX_SENT_ACCEN0_EN15_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_ACCEN0_Bits.EN15 */
#define IFX_SENT_ACCEN0_EN15_OFF (15u)

/** \brief  Length for Ifx_SENT_ACCEN0_Bits.EN16 */
#define IFX_SENT_ACCEN0_EN16_LEN (1u)

/** \brief  Mask for Ifx_SENT_ACCEN0_Bits.EN16 */
#define IFX_SENT_ACCEN0_EN16_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_ACCEN0_Bits.EN16 */
#define IFX_SENT_ACCEN0_EN16_OFF (16u)

/** \brief  Length for Ifx_SENT_ACCEN0_Bits.EN17 */
#define IFX_SENT_ACCEN0_EN17_LEN (1u)

/** \brief  Mask for Ifx_SENT_ACCEN0_Bits.EN17 */
#define IFX_SENT_ACCEN0_EN17_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_ACCEN0_Bits.EN17 */
#define IFX_SENT_ACCEN0_EN17_OFF (17u)

/** \brief  Length for Ifx_SENT_ACCEN0_Bits.EN18 */
#define IFX_SENT_ACCEN0_EN18_LEN (1u)

/** \brief  Mask for Ifx_SENT_ACCEN0_Bits.EN18 */
#define IFX_SENT_ACCEN0_EN18_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_ACCEN0_Bits.EN18 */
#define IFX_SENT_ACCEN0_EN18_OFF (18u)

/** \brief  Length for Ifx_SENT_ACCEN0_Bits.EN19 */
#define IFX_SENT_ACCEN0_EN19_LEN (1u)

/** \brief  Mask for Ifx_SENT_ACCEN0_Bits.EN19 */
#define IFX_SENT_ACCEN0_EN19_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_ACCEN0_Bits.EN19 */
#define IFX_SENT_ACCEN0_EN19_OFF (19u)

/** \brief  Length for Ifx_SENT_ACCEN0_Bits.EN1 */
#define IFX_SENT_ACCEN0_EN1_LEN (1u)

/** \brief  Mask for Ifx_SENT_ACCEN0_Bits.EN1 */
#define IFX_SENT_ACCEN0_EN1_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_ACCEN0_Bits.EN1 */
#define IFX_SENT_ACCEN0_EN1_OFF (1u)

/** \brief  Length for Ifx_SENT_ACCEN0_Bits.EN20 */
#define IFX_SENT_ACCEN0_EN20_LEN (1u)

/** \brief  Mask for Ifx_SENT_ACCEN0_Bits.EN20 */
#define IFX_SENT_ACCEN0_EN20_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_ACCEN0_Bits.EN20 */
#define IFX_SENT_ACCEN0_EN20_OFF (20u)

/** \brief  Length for Ifx_SENT_ACCEN0_Bits.EN21 */
#define IFX_SENT_ACCEN0_EN21_LEN (1u)

/** \brief  Mask for Ifx_SENT_ACCEN0_Bits.EN21 */
#define IFX_SENT_ACCEN0_EN21_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_ACCEN0_Bits.EN21 */
#define IFX_SENT_ACCEN0_EN21_OFF (21u)

/** \brief  Length for Ifx_SENT_ACCEN0_Bits.EN22 */
#define IFX_SENT_ACCEN0_EN22_LEN (1u)

