feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Prog/Libraries/Infra/Sfr/TC27D/_Reg/IfxSent_bf.h
/** \brief  Offset for Ifx_SENT_CH_INP_Bits.RBI */
#define IFX_SENT_CH_INP_RBI_OFF (8u)

/** \brief  Length for Ifx_SENT_CH_INP_Bits.RDI */
#define IFX_SENT_CH_INP_RDI_LEN (4u)

/** \brief  Mask for Ifx_SENT_CH_INP_Bits.RDI */
#define IFX_SENT_CH_INP_RDI_MSK (0xfu)

/** \brief  Offset for Ifx_SENT_CH_INP_Bits.RDI */
#define IFX_SENT_CH_INP_RDI_OFF (4u)

/** \brief  Length for Ifx_SENT_CH_INP_Bits.RSI */
#define IFX_SENT_CH_INP_RSI_LEN (4u)

/** \brief  Mask for Ifx_SENT_CH_INP_Bits.RSI */
#define IFX_SENT_CH_INP_RSI_MSK (0xfu)

/** \brief  Offset for Ifx_SENT_CH_INP_Bits.RSI */
#define IFX_SENT_CH_INP_RSI_OFF (0u)

/** \brief  Length for Ifx_SENT_CH_INP_Bits.SDI */
#define IFX_SENT_CH_INP_SDI_LEN (4u)

/** \brief  Mask for Ifx_SENT_CH_INP_Bits.SDI */
#define IFX_SENT_CH_INP_SDI_MSK (0xfu)

/** \brief  Offset for Ifx_SENT_CH_INP_Bits.SDI */
#define IFX_SENT_CH_INP_SDI_OFF (24u)

/** \brief  Length for Ifx_SENT_CH_INP_Bits.TBI */
#define IFX_SENT_CH_INP_TBI_LEN (4u)

/** \brief  Mask for Ifx_SENT_CH_INP_Bits.TBI */
#define IFX_SENT_CH_INP_TBI_MSK (0xfu)

/** \brief  Offset for Ifx_SENT_CH_INP_Bits.TBI */
#define IFX_SENT_CH_INP_TBI_OFF (16u)

/** \brief  Length for Ifx_SENT_CH_INP_Bits.TDI */
#define IFX_SENT_CH_INP_TDI_LEN (4u)

/** \brief  Mask for Ifx_SENT_CH_INP_Bits.TDI */
#define IFX_SENT_CH_INP_TDI_MSK (0xfu)

/** \brief  Offset for Ifx_SENT_CH_INP_Bits.TDI */
#define IFX_SENT_CH_INP_TDI_OFF (12u)

/** \brief  Length for Ifx_SENT_CH_INP_Bits.WDI */
#define IFX_SENT_CH_INP_WDI_LEN (4u)

/** \brief  Mask for Ifx_SENT_CH_INP_Bits.WDI */
#define IFX_SENT_CH_INP_WDI_MSK (0xfu)

/** \brief  Offset for Ifx_SENT_CH_INP_Bits.WDI */
#define IFX_SENT_CH_INP_WDI_OFF (28u)

/** \brief  Length for Ifx_SENT_CH_INTCLR_Bits.CRCI */
#define IFX_SENT_CH_INTCLR_CRCI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTCLR_Bits.CRCI */
#define IFX_SENT_CH_INTCLR_CRCI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_INTCLR_Bits.CRCI */
#define IFX_SENT_CH_INTCLR_CRCI_OFF (9u)

/** \brief  Length for Ifx_SENT_CH_INTCLR_Bits.FDI */
#define IFX_SENT_CH_INTCLR_FDI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTCLR_Bits.FDI */
#define IFX_SENT_CH_INTCLR_FDI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_INTCLR_Bits.FDI */
#define IFX_SENT_CH_INTCLR_FDI_OFF (6u)

/** \brief  Length for Ifx_SENT_CH_INTCLR_Bits.FRI */
#define IFX_SENT_CH_INTCLR_FRI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTCLR_Bits.FRI */
#define IFX_SENT_CH_INTCLR_FRI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_INTCLR_Bits.FRI */
#define IFX_SENT_CH_INTCLR_FRI_OFF (5u)

/** \brief  Length for Ifx_SENT_CH_INTCLR_Bits.NNI */
#define IFX_SENT_CH_INTCLR_NNI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTCLR_Bits.NNI */
#define IFX_SENT_CH_INTCLR_NNI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_INTCLR_Bits.NNI */
#define IFX_SENT_CH_INTCLR_NNI_OFF (7u)

/** \brief  Length for Ifx_SENT_CH_INTCLR_Bits.NVI */
#define IFX_SENT_CH_INTCLR_NVI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTCLR_Bits.NVI */
#define IFX_SENT_CH_INTCLR_NVI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_INTCLR_Bits.NVI */
#define IFX_SENT_CH_INTCLR_NVI_OFF (8u)

/** \brief  Length for Ifx_SENT_CH_INTCLR_Bits.RBI */
#define IFX_SENT_CH_INTCLR_RBI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTCLR_Bits.RBI */
#define IFX_SENT_CH_INTCLR_RBI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_INTCLR_Bits.RBI */
#define IFX_SENT_CH_INTCLR_RBI_OFF (2u)

/** \brief  Length for Ifx_SENT_CH_INTCLR_Bits.RDI */
#define IFX_SENT_CH_INTCLR_RDI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTCLR_Bits.RDI */
#define IFX_SENT_CH_INTCLR_RDI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_INTCLR_Bits.RDI */
#define IFX_SENT_CH_INTCLR_RDI_OFF (1u)

/** \brief  Length for Ifx_SENT_CH_INTCLR_Bits.RSI */
#define IFX_SENT_CH_INTCLR_RSI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTCLR_Bits.RSI */
#define IFX_SENT_CH_INTCLR_RSI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_INTCLR_Bits.RSI */
#define IFX_SENT_CH_INTCLR_RSI_OFF (0u)

/** \brief  Length for Ifx_SENT_CH_INTCLR_Bits.SCRI */
#define IFX_SENT_CH_INTCLR_SCRI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTCLR_Bits.SCRI */
#define IFX_SENT_CH_INTCLR_SCRI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_INTCLR_Bits.SCRI */
#define IFX_SENT_CH_INTCLR_SCRI_OFF (12u)

/** \brief  Length for Ifx_SENT_CH_INTCLR_Bits.SDI */
#define IFX_SENT_CH_INTCLR_SDI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTCLR_Bits.SDI */
#define IFX_SENT_CH_INTCLR_SDI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_INTCLR_Bits.SDI */
#define IFX_SENT_CH_INTCLR_SDI_OFF (11u)

/** \brief  Length for Ifx_SENT_CH_INTCLR_Bits.TBI */
#define IFX_SENT_CH_INTCLR_TBI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTCLR_Bits.TBI */
#define IFX_SENT_CH_INTCLR_TBI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_INTCLR_Bits.TBI */
#define IFX_SENT_CH_INTCLR_TBI_OFF (4u)

/** \brief  Length for Ifx_SENT_CH_INTCLR_Bits.TDI */
#define IFX_SENT_CH_INTCLR_TDI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTCLR_Bits.TDI */
#define IFX_SENT_CH_INTCLR_TDI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_INTCLR_Bits.TDI */
#define IFX_SENT_CH_INTCLR_TDI_OFF (3u)

/** \brief  Length for Ifx_SENT_CH_INTCLR_Bits.WDI */
#define IFX_SENT_CH_INTCLR_WDI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTCLR_Bits.WDI */
#define IFX_SENT_CH_INTCLR_WDI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_INTCLR_Bits.WDI */
#define IFX_SENT_CH_INTCLR_WDI_OFF (13u)

/** \brief  Length for Ifx_SENT_CH_INTCLR_Bits.WSI */
#define IFX_SENT_CH_INTCLR_WSI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTCLR_Bits.WSI */
#define IFX_SENT_CH_INTCLR_WSI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_INTCLR_Bits.WSI */
#define IFX_SENT_CH_INTCLR_WSI_OFF (10u)

/** \brief  Length for Ifx_SENT_CH_INTEN_Bits.CRCI */
#define IFX_SENT_CH_INTEN_CRCI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTEN_Bits.CRCI */
#define IFX_SENT_CH_INTEN_CRCI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_INTEN_Bits.CRCI */
#define IFX_SENT_CH_INTEN_CRCI_OFF (9u)

/** \brief  Length for Ifx_SENT_CH_INTEN_Bits.FDI */
#define IFX_SENT_CH_INTEN_FDI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTEN_Bits.FDI */
#define IFX_SENT_CH_INTEN_FDI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_INTEN_Bits.FDI */
#define IFX_SENT_CH_INTEN_FDI_OFF (6u)

/** \brief  Length for Ifx_SENT_CH_INTEN_Bits.FRI */
#define IFX_SENT_CH_INTEN_FRI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTEN_Bits.FRI */
#define IFX_SENT_CH_INTEN_FRI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_INTEN_Bits.FRI */
#define IFX_SENT_CH_INTEN_FRI_OFF (5u)

/** \brief  Length for Ifx_SENT_CH_INTEN_Bits.NNI */
#define IFX_SENT_CH_INTEN_NNI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTEN_Bits.NNI */
#define IFX_SENT_CH_INTEN_NNI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_INTEN_Bits.NNI */
#define IFX_SENT_CH_INTEN_NNI_OFF (7u)

/** \brief  Length for Ifx_SENT_CH_INTEN_Bits.NVI */
#define IFX_SENT_CH_INTEN_NVI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTEN_Bits.NVI */
#define IFX_SENT_CH_INTEN_NVI_MSK (0x1u)

