feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Prog/Libraries/Infra/Sfr/TC27D/_Reg/IfxSent_bf.h
/** \brief  Length for Ifx_SENT_CH_INTSET_Bits.WDI */
#define IFX_SENT_CH_INTSET_WDI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTSET_Bits.WDI */
#define IFX_SENT_CH_INTSET_WDI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_INTSET_Bits.WDI */
#define IFX_SENT_CH_INTSET_WDI_OFF (13u)

/** \brief  Length for Ifx_SENT_CH_INTSET_Bits.WSI */
#define IFX_SENT_CH_INTSET_WSI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTSET_Bits.WSI */
#define IFX_SENT_CH_INTSET_WSI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_INTSET_Bits.WSI */
#define IFX_SENT_CH_INTSET_WSI_OFF (10u)

/** \brief  Length for Ifx_SENT_CH_INTSTAT_Bits.CRCI */
#define IFX_SENT_CH_INTSTAT_CRCI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTSTAT_Bits.CRCI */
#define IFX_SENT_CH_INTSTAT_CRCI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_INTSTAT_Bits.CRCI */
#define IFX_SENT_CH_INTSTAT_CRCI_OFF (9u)

/** \brief  Length for Ifx_SENT_CH_INTSTAT_Bits.FDI */
#define IFX_SENT_CH_INTSTAT_FDI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTSTAT_Bits.FDI */
#define IFX_SENT_CH_INTSTAT_FDI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_INTSTAT_Bits.FDI */
#define IFX_SENT_CH_INTSTAT_FDI_OFF (6u)

/** \brief  Length for Ifx_SENT_CH_INTSTAT_Bits.FRI */
#define IFX_SENT_CH_INTSTAT_FRI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTSTAT_Bits.FRI */
#define IFX_SENT_CH_INTSTAT_FRI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_INTSTAT_Bits.FRI */
#define IFX_SENT_CH_INTSTAT_FRI_OFF (5u)

/** \brief  Length for Ifx_SENT_CH_INTSTAT_Bits.NNI */
#define IFX_SENT_CH_INTSTAT_NNI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTSTAT_Bits.NNI */
#define IFX_SENT_CH_INTSTAT_NNI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_INTSTAT_Bits.NNI */
#define IFX_SENT_CH_INTSTAT_NNI_OFF (7u)

/** \brief  Length for Ifx_SENT_CH_INTSTAT_Bits.NVI */
#define IFX_SENT_CH_INTSTAT_NVI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTSTAT_Bits.NVI */
#define IFX_SENT_CH_INTSTAT_NVI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_INTSTAT_Bits.NVI */
#define IFX_SENT_CH_INTSTAT_NVI_OFF (8u)

/** \brief  Length for Ifx_SENT_CH_INTSTAT_Bits.RBI */
#define IFX_SENT_CH_INTSTAT_RBI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTSTAT_Bits.RBI */
#define IFX_SENT_CH_INTSTAT_RBI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_INTSTAT_Bits.RBI */
#define IFX_SENT_CH_INTSTAT_RBI_OFF (2u)

/** \brief  Length for Ifx_SENT_CH_INTSTAT_Bits.RDI */
#define IFX_SENT_CH_INTSTAT_RDI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTSTAT_Bits.RDI */
#define IFX_SENT_CH_INTSTAT_RDI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_INTSTAT_Bits.RDI */
#define IFX_SENT_CH_INTSTAT_RDI_OFF (1u)

/** \brief  Length for Ifx_SENT_CH_INTSTAT_Bits.RSI */
#define IFX_SENT_CH_INTSTAT_RSI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTSTAT_Bits.RSI */
#define IFX_SENT_CH_INTSTAT_RSI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_INTSTAT_Bits.RSI */
#define IFX_SENT_CH_INTSTAT_RSI_OFF (0u)

/** \brief  Length for Ifx_SENT_CH_INTSTAT_Bits.SCRI */
#define IFX_SENT_CH_INTSTAT_SCRI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTSTAT_Bits.SCRI */
#define IFX_SENT_CH_INTSTAT_SCRI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_INTSTAT_Bits.SCRI */
#define IFX_SENT_CH_INTSTAT_SCRI_OFF (12u)

/** \brief  Length for Ifx_SENT_CH_INTSTAT_Bits.SDI */
#define IFX_SENT_CH_INTSTAT_SDI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTSTAT_Bits.SDI */
#define IFX_SENT_CH_INTSTAT_SDI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_INTSTAT_Bits.SDI */
#define IFX_SENT_CH_INTSTAT_SDI_OFF (11u)

/** \brief  Length for Ifx_SENT_CH_INTSTAT_Bits.TBI */
#define IFX_SENT_CH_INTSTAT_TBI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTSTAT_Bits.TBI */
#define IFX_SENT_CH_INTSTAT_TBI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_INTSTAT_Bits.TBI */
#define IFX_SENT_CH_INTSTAT_TBI_OFF (4u)

/** \brief  Length for Ifx_SENT_CH_INTSTAT_Bits.TDI */
#define IFX_SENT_CH_INTSTAT_TDI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTSTAT_Bits.TDI */
#define IFX_SENT_CH_INTSTAT_TDI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_INTSTAT_Bits.TDI */
#define IFX_SENT_CH_INTSTAT_TDI_OFF (3u)

/** \brief  Length for Ifx_SENT_CH_INTSTAT_Bits.WDI */
#define IFX_SENT_CH_INTSTAT_WDI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTSTAT_Bits.WDI */
#define IFX_SENT_CH_INTSTAT_WDI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_INTSTAT_Bits.WDI */
#define IFX_SENT_CH_INTSTAT_WDI_OFF (13u)

/** \brief  Length for Ifx_SENT_CH_INTSTAT_Bits.WSI */
#define IFX_SENT_CH_INTSTAT_WSI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTSTAT_Bits.WSI */
#define IFX_SENT_CH_INTSTAT_WSI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_INTSTAT_Bits.WSI */
#define IFX_SENT_CH_INTSTAT_WSI_OFF (10u)

/** \brief  Length for Ifx_SENT_CH_IOCR_Bits.ALTI */
#define IFX_SENT_CH_IOCR_ALTI_LEN (2u)

/** \brief  Mask for Ifx_SENT_CH_IOCR_Bits.ALTI */
#define IFX_SENT_CH_IOCR_ALTI_MSK (0x3u)

/** \brief  Offset for Ifx_SENT_CH_IOCR_Bits.ALTI */
#define IFX_SENT_CH_IOCR_ALTI_OFF (0u)

/** \brief  Length for Ifx_SENT_CH_IOCR_Bits.CEC */
#define IFX_SENT_CH_IOCR_CEC_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_IOCR_Bits.CEC */
#define IFX_SENT_CH_IOCR_CEC_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_IOCR_Bits.CEC */
#define IFX_SENT_CH_IOCR_CEC_OFF (10u)

/** \brief  Length for Ifx_SENT_CH_IOCR_Bits.CFEG */
#define IFX_SENT_CH_IOCR_CFEG_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_IOCR_Bits.CFEG */
#define IFX_SENT_CH_IOCR_CFEG_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_IOCR_Bits.CFEG */
#define IFX_SENT_CH_IOCR_CFEG_OFF (15u)

/** \brief  Length for Ifx_SENT_CH_IOCR_Bits.CREG */
#define IFX_SENT_CH_IOCR_CREG_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_IOCR_Bits.CREG */
#define IFX_SENT_CH_IOCR_CREG_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_IOCR_Bits.CREG */
#define IFX_SENT_CH_IOCR_CREG_OFF (14u)

/** \brief  Length for Ifx_SENT_CH_IOCR_Bits.CTR */
#define IFX_SENT_CH_IOCR_CTR_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_IOCR_Bits.CTR */
#define IFX_SENT_CH_IOCR_CTR_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_IOCR_Bits.CTR */
#define IFX_SENT_CH_IOCR_CTR_OFF (28u)

/** \brief  Length for Ifx_SENT_CH_IOCR_Bits.DEPTH */
#define IFX_SENT_CH_IOCR_DEPTH_LEN (4u)

