feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Prog/Libraries/Infra/Sfr/TC27D/_Reg/IfxSent_bf.h
/** \brief  Mask for Ifx_SENT_CH_IOCR_Bits.DEPTH */
#define IFX_SENT_CH_IOCR_DEPTH_MSK (0xfu)

/** \brief  Offset for Ifx_SENT_CH_IOCR_Bits.DEPTH */
#define IFX_SENT_CH_IOCR_DEPTH_OFF (4u)

/** \brief  Length for Ifx_SENT_CH_IOCR_Bits.EC */
#define IFX_SENT_CH_IOCR_EC_LEN (8u)

/** \brief  Mask for Ifx_SENT_CH_IOCR_Bits.EC */
#define IFX_SENT_CH_IOCR_EC_MSK (0xffu)

/** \brief  Offset for Ifx_SENT_CH_IOCR_Bits.EC */
#define IFX_SENT_CH_IOCR_EC_OFF (20u)

/** \brief  Length for Ifx_SENT_CH_IOCR_Bits.ETS */
#define IFX_SENT_CH_IOCR_ETS_LEN (4u)

/** \brief  Mask for Ifx_SENT_CH_IOCR_Bits.ETS */
#define IFX_SENT_CH_IOCR_ETS_MSK (0xfu)

/** \brief  Offset for Ifx_SENT_CH_IOCR_Bits.ETS */
#define IFX_SENT_CH_IOCR_ETS_OFF (16u)

/** \brief  Length for Ifx_SENT_CH_IOCR_Bits.FEG */
#define IFX_SENT_CH_IOCR_FEG_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_IOCR_Bits.FEG */
#define IFX_SENT_CH_IOCR_FEG_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_IOCR_Bits.FEG */
#define IFX_SENT_CH_IOCR_FEG_OFF (13u)

/** \brief  Length for Ifx_SENT_CH_IOCR_Bits.IIE */
#define IFX_SENT_CH_IOCR_IIE_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_IOCR_Bits.IIE */
#define IFX_SENT_CH_IOCR_IIE_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_IOCR_Bits.IIE */
#define IFX_SENT_CH_IOCR_IIE_OFF (9u)

/** \brief  Length for Ifx_SENT_CH_IOCR_Bits.OIE */
#define IFX_SENT_CH_IOCR_OIE_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_IOCR_Bits.OIE */
#define IFX_SENT_CH_IOCR_OIE_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_IOCR_Bits.OIE */
#define IFX_SENT_CH_IOCR_OIE_OFF (8u)

/** \brief  Length for Ifx_SENT_CH_IOCR_Bits.REG */
#define IFX_SENT_CH_IOCR_REG_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_IOCR_Bits.REG */
#define IFX_SENT_CH_IOCR_REG_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_IOCR_Bits.REG */
#define IFX_SENT_CH_IOCR_REG_OFF (12u)

/** \brief  Length for Ifx_SENT_CH_IOCR_Bits.RXM */
#define IFX_SENT_CH_IOCR_RXM_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_IOCR_Bits.RXM */
#define IFX_SENT_CH_IOCR_RXM_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_IOCR_Bits.RXM */
#define IFX_SENT_CH_IOCR_RXM_OFF (30u)

/** \brief  Length for Ifx_SENT_CH_IOCR_Bits.TRM */
#define IFX_SENT_CH_IOCR_TRM_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_IOCR_Bits.TRM */
#define IFX_SENT_CH_IOCR_TRM_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_IOCR_Bits.TRM */
#define IFX_SENT_CH_IOCR_TRM_OFF (29u)

/** \brief  Length for Ifx_SENT_CH_IOCR_Bits.TXM */
#define IFX_SENT_CH_IOCR_TXM_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_IOCR_Bits.TXM */
#define IFX_SENT_CH_IOCR_TXM_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_IOCR_Bits.TXM */
#define IFX_SENT_CH_IOCR_TXM_OFF (31u)

/** \brief  Length for Ifx_SENT_CH_RCR_Bits.ACE */
#define IFX_SENT_CH_RCR_ACE_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_RCR_Bits.ACE */
#define IFX_SENT_CH_RCR_ACE_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_RCR_Bits.ACE */
#define IFX_SENT_CH_RCR_ACE_OFF (2u)

/** \brief  Length for Ifx_SENT_CH_RCR_Bits.CDIS */
#define IFX_SENT_CH_RCR_CDIS_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_RCR_Bits.CDIS */
#define IFX_SENT_CH_RCR_CDIS_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_RCR_Bits.CDIS */
#define IFX_SENT_CH_RCR_CDIS_OFF (6u)

/** \brief  Length for Ifx_SENT_CH_RCR_Bits.CEN */
#define IFX_SENT_CH_RCR_CEN_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_RCR_Bits.CEN */
#define IFX_SENT_CH_RCR_CEN_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_RCR_Bits.CEN */
#define IFX_SENT_CH_RCR_CEN_OFF (0u)

/** \brief  Length for Ifx_SENT_CH_RCR_Bits.CFC */
#define IFX_SENT_CH_RCR_CFC_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_RCR_Bits.CFC */
#define IFX_SENT_CH_RCR_CFC_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_RCR_Bits.CFC */
#define IFX_SENT_CH_RCR_CFC_OFF (7u)

/** \brief  Length for Ifx_SENT_CH_RCR_Bits.CRZ */
#define IFX_SENT_CH_RCR_CRZ_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_RCR_Bits.CRZ */
#define IFX_SENT_CH_RCR_CRZ_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_RCR_Bits.CRZ */
#define IFX_SENT_CH_RCR_CRZ_OFF (16u)

/** \brief  Length for Ifx_SENT_CH_RCR_Bits.ESF */
#define IFX_SENT_CH_RCR_ESF_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_RCR_Bits.ESF */
#define IFX_SENT_CH_RCR_ESF_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_RCR_Bits.ESF */
#define IFX_SENT_CH_RCR_ESF_OFF (17u)

/** \brief  Length for Ifx_SENT_CH_RCR_Bits.FRL */
#define IFX_SENT_CH_RCR_FRL_LEN (8u)

/** \brief  Mask for Ifx_SENT_CH_RCR_Bits.FRL */
#define IFX_SENT_CH_RCR_FRL_MSK (0xffu)

/** \brief  Offset for Ifx_SENT_CH_RCR_Bits.FRL */
#define IFX_SENT_CH_RCR_FRL_OFF (8u)

/** \brief  Length for Ifx_SENT_CH_RCR_Bits.IDE */
#define IFX_SENT_CH_RCR_IDE_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_RCR_Bits.IDE */
#define IFX_SENT_CH_RCR_IDE_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_RCR_Bits.IDE */
#define IFX_SENT_CH_RCR_IDE_OFF (18u)

/** \brief  Length for Ifx_SENT_CH_RCR_Bits.IEP */
#define IFX_SENT_CH_RCR_IEP_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_RCR_Bits.IEP */
#define IFX_SENT_CH_RCR_IEP_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_RCR_Bits.IEP */
#define IFX_SENT_CH_RCR_IEP_OFF (1u)

/** \brief  Length for Ifx_SENT_CH_RCR_Bits.SCDIS */
#define IFX_SENT_CH_RCR_SCDIS_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_RCR_Bits.SCDIS */
#define IFX_SENT_CH_RCR_SCDIS_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_RCR_Bits.SCDIS */
#define IFX_SENT_CH_RCR_SCDIS_OFF (5u)

/** \brief  Length for Ifx_SENT_CH_RCR_Bits.SDP */
#define IFX_SENT_CH_RCR_SDP_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_RCR_Bits.SDP */
#define IFX_SENT_CH_RCR_SDP_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_RCR_Bits.SDP */
#define IFX_SENT_CH_RCR_SDP_OFF (4u)

/** \brief  Length for Ifx_SENT_CH_RCR_Bits.SNI */
#define IFX_SENT_CH_RCR_SNI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_RCR_Bits.SNI */
#define IFX_SENT_CH_RCR_SNI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_RCR_Bits.SNI */
#define IFX_SENT_CH_RCR_SNI_OFF (3u)

/** \brief  Length for Ifx_SENT_CH_RCR_Bits.SUSEN */
#define IFX_SENT_CH_RCR_SUSEN_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_RCR_Bits.SUSEN */
#define IFX_SENT_CH_RCR_SUSEN_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_RCR_Bits.SUSEN */
#define IFX_SENT_CH_RCR_SUSEN_OFF (19u)

/** \brief  Length for Ifx_SENT_CH_RSR_Bits.CRC */
#define IFX_SENT_CH_RSR_CRC_LEN (4u)

/** \brief  Mask for Ifx_SENT_CH_RSR_Bits.CRC */
#define IFX_SENT_CH_RSR_CRC_MSK (0xfu)

/** \brief  Offset for Ifx_SENT_CH_RSR_Bits.CRC */
#define IFX_SENT_CH_RSR_CRC_OFF (0u)

/** \brief  Length for Ifx_SENT_CH_RSR_Bits.CST */
#define IFX_SENT_CH_RSR_CST_LEN (2u)

/** \brief  Mask for Ifx_SENT_CH_RSR_Bits.CST */
#define IFX_SENT_CH_RSR_CST_MSK (0x3u)

/** \brief  Offset for Ifx_SENT_CH_RSR_Bits.CST */
#define IFX_SENT_CH_RSR_CST_OFF (4u)

/** \brief  Length for Ifx_SENT_CH_RSR_Bits.SCN */
#define IFX_SENT_CH_RSR_SCN_LEN (4u)

/** \brief  Mask for Ifx_SENT_CH_RSR_Bits.SCN */
#define IFX_SENT_CH_RSR_SCN_MSK (0xfu)

/** \brief  Offset for Ifx_SENT_CH_RSR_Bits.SCN */
#define IFX_SENT_CH_RSR_SCN_OFF (8u)

/** \brief  Length for Ifx_SENT_CH_SCR_Bits.BASE */
#define IFX_SENT_CH_SCR_BASE_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_SCR_Bits.BASE */
#define IFX_SENT_CH_SCR_BASE_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_SCR_Bits.BASE */
#define IFX_SENT_CH_SCR_BASE_OFF (14u)

/** \brief  Length for Ifx_SENT_CH_SCR_Bits.DEL */
#define IFX_SENT_CH_SCR_DEL_LEN (6u)

/** \brief  Mask for Ifx_SENT_CH_SCR_Bits.DEL */
#define IFX_SENT_CH_SCR_DEL_MSK (0x3fu)

/** \brief  Offset for Ifx_SENT_CH_SCR_Bits.DEL */
#define IFX_SENT_CH_SCR_DEL_OFF (8u)

/** \brief  Length for Ifx_SENT_CH_SCR_Bits.PLEN */
#define IFX_SENT_CH_SCR_PLEN_LEN (6u)

