feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Prog/Libraries/Infra/Sfr/TC27D/_Reg/IfxSent_bf.h
/** \brief  Mask for Ifx_SENT_CH_SCR_Bits.PLEN */
#define IFX_SENT_CH_SCR_PLEN_MSK (0x3fu)

/** \brief  Offset for Ifx_SENT_CH_SCR_Bits.PLEN */
#define IFX_SENT_CH_SCR_PLEN_OFF (0u)

/** \brief  Length for Ifx_SENT_CH_SCR_Bits.TRIG */
#define IFX_SENT_CH_SCR_TRIG_LEN (2u)

/** \brief  Mask for Ifx_SENT_CH_SCR_Bits.TRIG */
#define IFX_SENT_CH_SCR_TRIG_MSK (0x3u)

/** \brief  Offset for Ifx_SENT_CH_SCR_Bits.TRIG */
#define IFX_SENT_CH_SCR_TRIG_OFF (6u)

/** \brief  Length for Ifx_SENT_CH_SCR_Bits.TRQ */
#define IFX_SENT_CH_SCR_TRQ_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_SCR_Bits.TRQ */
#define IFX_SENT_CH_SCR_TRQ_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_SCR_Bits.TRQ */
#define IFX_SENT_CH_SCR_TRQ_OFF (15u)

/** \brief  Length for Ifx_SENT_CH_SDS_Bits.CON */
#define IFX_SENT_CH_SDS_CON_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_SDS_Bits.CON */
#define IFX_SENT_CH_SDS_CON_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_SDS_Bits.CON */
#define IFX_SENT_CH_SDS_CON_OFF (31u)

/** \brief  Length for Ifx_SENT_CH_SDS_Bits.MID */
#define IFX_SENT_CH_SDS_MID_LEN (8u)

/** \brief  Mask for Ifx_SENT_CH_SDS_Bits.MID */
#define IFX_SENT_CH_SDS_MID_MSK (0xffu)

/** \brief  Offset for Ifx_SENT_CH_SDS_Bits.MID */
#define IFX_SENT_CH_SDS_MID_OFF (16u)

/** \brief  Length for Ifx_SENT_CH_SDS_Bits.SCRC */
#define IFX_SENT_CH_SDS_SCRC_LEN (6u)

/** \brief  Mask for Ifx_SENT_CH_SDS_Bits.SCRC */
#define IFX_SENT_CH_SDS_SCRC_MSK (0x3fu)

/** \brief  Offset for Ifx_SENT_CH_SDS_Bits.SCRC */
#define IFX_SENT_CH_SDS_SCRC_OFF (24u)

/** \brief  Length for Ifx_SENT_CH_SDS_Bits.SD */
#define IFX_SENT_CH_SDS_SD_LEN (16u)

/** \brief  Mask for Ifx_SENT_CH_SDS_Bits.SD */
#define IFX_SENT_CH_SDS_SD_MSK (0xffffu)

/** \brief  Offset for Ifx_SENT_CH_SDS_Bits.SD */
#define IFX_SENT_CH_SDS_SD_OFF (0u)

/** \brief  Length for Ifx_SENT_CH_VIEW_Bits.RDNP0 */
#define IFX_SENT_CH_VIEW_RDNP0_LEN (3u)

/** \brief  Mask for Ifx_SENT_CH_VIEW_Bits.RDNP0 */
#define IFX_SENT_CH_VIEW_RDNP0_MSK (0x7u)

/** \brief  Offset for Ifx_SENT_CH_VIEW_Bits.RDNP0 */
#define IFX_SENT_CH_VIEW_RDNP0_OFF (0u)

/** \brief  Length for Ifx_SENT_CH_VIEW_Bits.RDNP1 */
#define IFX_SENT_CH_VIEW_RDNP1_LEN (3u)

/** \brief  Mask for Ifx_SENT_CH_VIEW_Bits.RDNP1 */
#define IFX_SENT_CH_VIEW_RDNP1_MSK (0x7u)

/** \brief  Offset for Ifx_SENT_CH_VIEW_Bits.RDNP1 */
#define IFX_SENT_CH_VIEW_RDNP1_OFF (4u)

/** \brief  Length for Ifx_SENT_CH_VIEW_Bits.RDNP2 */
#define IFX_SENT_CH_VIEW_RDNP2_LEN (3u)

/** \brief  Mask for Ifx_SENT_CH_VIEW_Bits.RDNP2 */
#define IFX_SENT_CH_VIEW_RDNP2_MSK (0x7u)

/** \brief  Offset for Ifx_SENT_CH_VIEW_Bits.RDNP2 */
#define IFX_SENT_CH_VIEW_RDNP2_OFF (8u)

/** \brief  Length for Ifx_SENT_CH_VIEW_Bits.RDNP3 */
#define IFX_SENT_CH_VIEW_RDNP3_LEN (3u)

/** \brief  Mask for Ifx_SENT_CH_VIEW_Bits.RDNP3 */
#define IFX_SENT_CH_VIEW_RDNP3_MSK (0x7u)

/** \brief  Offset for Ifx_SENT_CH_VIEW_Bits.RDNP3 */
#define IFX_SENT_CH_VIEW_RDNP3_OFF (12u)

/** \brief  Length for Ifx_SENT_CH_VIEW_Bits.RDNP4 */
#define IFX_SENT_CH_VIEW_RDNP4_LEN (3u)

/** \brief  Mask for Ifx_SENT_CH_VIEW_Bits.RDNP4 */
#define IFX_SENT_CH_VIEW_RDNP4_MSK (0x7u)

/** \brief  Offset for Ifx_SENT_CH_VIEW_Bits.RDNP4 */
#define IFX_SENT_CH_VIEW_RDNP4_OFF (16u)

/** \brief  Length for Ifx_SENT_CH_VIEW_Bits.RDNP5 */
#define IFX_SENT_CH_VIEW_RDNP5_LEN (3u)

/** \brief  Mask for Ifx_SENT_CH_VIEW_Bits.RDNP5 */
#define IFX_SENT_CH_VIEW_RDNP5_MSK (0x7u)

/** \brief  Offset for Ifx_SENT_CH_VIEW_Bits.RDNP5 */
#define IFX_SENT_CH_VIEW_RDNP5_OFF (20u)

/** \brief  Length for Ifx_SENT_CH_VIEW_Bits.RDNP6 */
#define IFX_SENT_CH_VIEW_RDNP6_LEN (3u)

/** \brief  Mask for Ifx_SENT_CH_VIEW_Bits.RDNP6 */
#define IFX_SENT_CH_VIEW_RDNP6_MSK (0x7u)

/** \brief  Offset for Ifx_SENT_CH_VIEW_Bits.RDNP6 */
#define IFX_SENT_CH_VIEW_RDNP6_OFF (24u)

/** \brief  Length for Ifx_SENT_CH_VIEW_Bits.RDNP7 */
#define IFX_SENT_CH_VIEW_RDNP7_LEN (3u)

/** \brief  Mask for Ifx_SENT_CH_VIEW_Bits.RDNP7 */
#define IFX_SENT_CH_VIEW_RDNP7_MSK (0x7u)

/** \brief  Offset for Ifx_SENT_CH_VIEW_Bits.RDNP7 */
#define IFX_SENT_CH_VIEW_RDNP7_OFF (28u)

/** \brief  Length for Ifx_SENT_CH_WDT_Bits.WDLx */
#define IFX_SENT_CH_WDT_WDLX_LEN (16u)

/** \brief  Mask for Ifx_SENT_CH_WDT_Bits.WDLx */
#define IFX_SENT_CH_WDT_WDLX_MSK (0xffffu)

/** \brief  Offset for Ifx_SENT_CH_WDT_Bits.WDLx */
#define IFX_SENT_CH_WDT_WDLX_OFF (0u)

/** \brief  Length for Ifx_SENT_CLC_Bits.DISR */
#define IFX_SENT_CLC_DISR_LEN (1u)

/** \brief  Mask for Ifx_SENT_CLC_Bits.DISR */
#define IFX_SENT_CLC_DISR_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CLC_Bits.DISR */
#define IFX_SENT_CLC_DISR_OFF (0u)

/** \brief  Length for Ifx_SENT_CLC_Bits.DISS */
#define IFX_SENT_CLC_DISS_LEN (1u)

/** \brief  Mask for Ifx_SENT_CLC_Bits.DISS */
#define IFX_SENT_CLC_DISS_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CLC_Bits.DISS */
#define IFX_SENT_CLC_DISS_OFF (1u)

/** \brief  Length for Ifx_SENT_CLC_Bits.EDIS */
#define IFX_SENT_CLC_EDIS_LEN (1u)

/** \brief  Mask for Ifx_SENT_CLC_Bits.EDIS */
#define IFX_SENT_CLC_EDIS_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CLC_Bits.EDIS */
#define IFX_SENT_CLC_EDIS_OFF (3u)

/** \brief  Length for Ifx_SENT_CLC_Bits.RMC */
#define IFX_SENT_CLC_RMC_LEN (8u)

/** \brief  Mask for Ifx_SENT_CLC_Bits.RMC */
#define IFX_SENT_CLC_RMC_MSK (0xffu)

/** \brief  Offset for Ifx_SENT_CLC_Bits.RMC */
#define IFX_SENT_CLC_RMC_OFF (8u)

/** \brief  Length for Ifx_SENT_FDR_Bits.DM */
#define IFX_SENT_FDR_DM_LEN (2u)

/** \brief  Mask for Ifx_SENT_FDR_Bits.DM */
#define IFX_SENT_FDR_DM_MSK (0x3u)

/** \brief  Offset for Ifx_SENT_FDR_Bits.DM */
#define IFX_SENT_FDR_DM_OFF (14u)

/** \brief  Length for Ifx_SENT_FDR_Bits.RESULT */
#define IFX_SENT_FDR_RESULT_LEN (10u)

/** \brief  Mask for Ifx_SENT_FDR_Bits.RESULT */
#define IFX_SENT_FDR_RESULT_MSK (0x3ffu)

/** \brief  Offset for Ifx_SENT_FDR_Bits.RESULT */
#define IFX_SENT_FDR_RESULT_OFF (16u)

/** \brief  Length for Ifx_SENT_FDR_Bits.STEP */
#define IFX_SENT_FDR_STEP_LEN (10u)

/** \brief  Mask for Ifx_SENT_FDR_Bits.STEP */
#define IFX_SENT_FDR_STEP_MSK (0x3ffu)

/** \brief  Offset for Ifx_SENT_FDR_Bits.STEP */
#define IFX_SENT_FDR_STEP_OFF (0u)

/** \brief  Length for Ifx_SENT_ID_Bits.MODNUMBER */
#define IFX_SENT_ID_MODNUMBER_LEN (16u)

/** \brief  Mask for Ifx_SENT_ID_Bits.MODNUMBER */
#define IFX_SENT_ID_MODNUMBER_MSK (0xffffu)

/** \brief  Offset for Ifx_SENT_ID_Bits.MODNUMBER */
#define IFX_SENT_ID_MODNUMBER_OFF (16u)

/** \brief  Length for Ifx_SENT_ID_Bits.MODREV */
#define IFX_SENT_ID_MODREV_LEN (8u)

/** \brief  Mask for Ifx_SENT_ID_Bits.MODREV */
#define IFX_SENT_ID_MODREV_MSK (0xffu)

/** \brief  Offset for Ifx_SENT_ID_Bits.MODREV */
#define IFX_SENT_ID_MODREV_OFF (0u)

/** \brief  Length for Ifx_SENT_ID_Bits.MODTYPE */
#define IFX_SENT_ID_MODTYPE_LEN (8u)

/** \brief  Mask for Ifx_SENT_ID_Bits.MODTYPE */
#define IFX_SENT_ID_MODTYPE_MSK (0xffu)

